Revit 2027 API
BuiltInFailures.EditingFailures.CannotMoveElementWarn Property
 Can't move element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveElementWarn { get; }
Public Shared ReadOnly Property CannotMoveElementWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveElementWarn {
	FailureDefinitionId^ get ();
}
static member CannotMoveElementWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace